Repository: MobiFlight/MobiFlight-Connector
Catalog: UI/Dialogs/ConfigWizard.*.resx
Languages: de

# compareTabPage.Text
source: Compare
de: Vergleichen

# interpolationGroupBox.Text
source: Interpolation Settings
de: Interpolation Einstellungen

# interpolationCheckBox.Text
source: Apply interpolation to modify the current value
de: Interpolation anwenden um aktuellen Wert zu ändern

# comparisonSettingsGroupBox.Text
source: Comparison Settings
de: Vergleichs-Einstellungen

# label8.Text
source: else set it to
de: sonst

# label7.Text
source: set it to
de: dann setze

# label6.Text
source: If current value is
de: Wenn aktueller Wert

# comparisonActiveCheckBox.Text
source: Apply comparison to modify the current value
de: Wende Vergleich an, um den Wert zu beeinflussen

# comparisonHintTtextBox.Text
source: Often it is necessary to compare the current value to a certain other value - e.g. determine flaps extension - and sometimes even set to a different value - e.g. heading from 360 to 0.
de: Es ist oft notwendig den aktuellen Wert mit einem anderen zu vergleichen (z.B. Klappenstellung) und je nach Ergebnis komplett abzuändern - z.B. Kursanzeige-Wert von 360 zu 0.

# testSettingsGroupBox.Text
source: Test current settings
de: Einstellungen testen

# groupBoxDisplaySettings.Text
source: Display settings
de: Display Einstellungen

# displayTypeGroupBox.Text
source: Display type
de: Display Typ

# arcazeSerialLabel.Text
source: Module
de: Modul

# displayTypeComboBoxLabel.Text
source: Use type of
de: Verwende Typ

# displayTabTextBox.Text
source: Choose your display type which is used for output from the list below.
de: Bitte passenden Display-Typ wählen, der für die Ausgabe verwendet werden soll.

# preconditionTabPage.Text
source: Precondition
de: Vorbedingung

# preconditionSettingsGroupBox.Text
source: Precondition settings
de: Einstellung für Vorbedingung

# preconditionPinValueLabel.Text
source: If current state is
de: Wenn Zustand

# preconditionPinSerialLabel.Text
source: Arcaze Module
de: Arcaze Modul

# preconditionConfigRefOperandLabel.Text
source: If current value is
de: Wenn aktueller Wert

# label11.Text
source: Choose config
de: Wähle Config

# preconditionApplyButton.Text
source: Apply
de: Anwenden

# preconditionSelectGroupBox.Text
source: Precondition type
de: Art der Vorbedingung

# preconditionTypeLabel.Text
source: Use type of
de: Verwende Art

# preconditionListgroupBox.Text
source: Precondition list
de: Liste Vorbedingungen

# addPreconditionToolStripMenuItem.Text
source: Add Precondition
de: Vorbedingung hinzufügen

# removePreconditionToolStripMenuItem.Text
source: Remove Precondition
de: Vorbedingung entfernen

# addGroupToolStripMenuItem.Text
source: Add group
de: Neue Gruppe

# removeGroupToolStripMenuItem.Text
source: Remove group
de: Gruppe entfernen

# logicSelectToolStripMenuItem.Text
source: Logic operator
de: Logikoperator

# preconditionTabTextBox.Text
source: Define a precondition for this rule. Only if the precondition is true the current config will apply. This is useful, ex. for a multi-radio.
de: Legen Sie eine Vorbedingung für diese Konfiguration an. Nur wenn die Vorbedingung erfüllt ist, wird die Konfiguration berücksichtigt. Das ist z.B. für ein Multi-Radio sinnvoll.

# cancelButton.Text
source: Cancel
de: Abbrechen
