Repository: MobiFlight/MobiFlight-Connector
Catalog: UI/Panels/Settings/MobiFlightPanel.*.resx
Languages: de

# FwAutoInstallCheckBox.Text
source: Scan for compatible boards on start
de: Suche nach kompatiblen Boards während Startup

# FwAutoInstallCheckBox.ToolTip
source: When enabled MobiFlight asks to upload the firmware if it finds a compatible board on startup.
de: Wenn aktiviert, dann bietet MobiFlight während dem Start die Installation der Firmware für kompatible Boards an.

# firmwareSettingsGroupBox.Text
source: Additional Settings
de: Firmware Flash Einstellungen

# mobiflightSettingsLabel.Text
source: Configure connected MobiFlight Boards. You can save and load configurations and upload them to your modules.
de: Konfiguriere angeschlossene MobiFlight Module. Du kannst Konfigurationen Laden, Bearbeiten und Speichern und auf Dein Modul hochladen.

# buttonToolStripMenuItem.Text
source: Button
de: Schalter

# addToolStripMenuItem.Text
source: Add device
de: Neues Device

# removeToolStripMenuItem.Text
source: Remove device
de: Entferne Device

# openToolStripMenuItem.Text
source: Open
de: Öffnen

# saveToolStripMenuItem.Text
source: Save As...
de: Speichern unter...

# regenerateSerialToolStripMenuItem.Text
source: Regenerate Serial
de: Neue Seriennummer

# reloadConfigToolStripMenuItem.Text
source: Reload Config
de: Config neu laden

# addButtonToolStripMenuItem.Text
source: Button
de: Schalter

# addDeviceToolStripDropDownButton.Text
source: Add device
de: Neues Device

# removeDeviceToolStripButton.Text
source: Remove device
de: Entferne Device

# mfConfiguredModulesGroupBox.Text
source: Configured modules
de: Angeschlossene Module
