Repository: MobiFlight/MobiFlight-Connector
Catalog: UI/MainForm.*.resx
Languages: de

# toolStripMenuItem3.Text
source: New
de: Neues Projekt

# openToolStripMenuItem.Text
source: Open...
de: Öffnen...

# konfigurationSpeichernToolStripMenuItem.Text
source: Save As...
de: Speichern als...

# recentDocumentsToolStripMenuItem.Text
source: Recent Documents...
de: Zuletzt geöffnet...

# beendenToolStripMenuItem.Text
source: Exit
de: Beenden

# fileToolStripMenuItem.Text
source: File
de: Datei

# orphanedSerialsFinderToolStripMenuItem.Text
source: Manage orphaned serials
de: Verwaiste Module verwalten

# settingsToolStripMenuItem.Text
source: Settings
de: Einstellungen

# helpToolStripMenuItem.Text
source: Open help in web
de: Hilfe im Web öffnen

# checkForUpdateToolStripMenuItem.Text
source: Check for update
de: Nach Update suchen

# openDiscordServerToolStripMenuItem.Text
source: Join Discord Server
de: Discord Server öffnen

# openHubHopWebsiteToolStripMenuItem.Text
source: Visit HubHop Website
de: HubHop Website öffnen

# openYoutubeChannelToolStripMenuItem.Text
source: Visit Youtube Channel
de: Youtube Channel öffnen

# überToolStripMenuItem.Text
source: About
de: Info

# hilfeToolStripMenuItem.Text
source: Help
de: Hilfe

# wiederherstellenToolStripMenuItem.Text
source: Restore MobiFlight
de: Wiederherstellen

# exitToolStripMenuItem.Text
source: Exit
de: Beenden

# notifyIcon.Text
source: MobiFlight Connector
de: MFConnector

# saveToolStripButton.Text
source: Save
de: Speichern

# runToolStripButton.Text
source: Run
de: Start

# runTestToolStripButton.ToolTipText
source: Run test mode to check if all display settings are correct.
de: Führen Sie den Test-Modus aus, um alle Anzeige-Einstellungen zu testen.

# autoRunToolStripButton.ToolTipText
source: If activated the last loaded config will be run automatically on next start-up
de: Wenn aktiviert, wird die zuletzt geladene Konfiguration beim nächsten Programmstart automatisch ausgeführt.

# donateToolStripButton.ToolTipText
source: Say "Thank You" to Sebastian by donating via PayPal
de: Sag "Dankeschön" zu Sebastian durch eine Spende via PayPal

# toolStripButton1.ToolTipText
source: Join Discord Server
de: Gehe zu Discord Server

# HubHopToolStripButton.ToolTipText
source: Visit HubHop Website
de: Gehe zu HubHop Website

# YouTubeToolStripButton.ToolTipText
source: Visit YouTube Channel
de: Gehe zu YouTube Channel

# exitToolStripButton.Text
source: Exit
de: Beenden

# linkCurrentConfigToolStripMenuItem.Text
source: Link current config
de: Verknüpfe aktuelle Config

# openLinkedConfigToolStripMenuItem.Text
source: Open linked config
de: Öffne verknüpfte Config

# removeLinkConfigToolStripMenuItem.Text
source: Remove link
de: Entferne Verlinkung

# removeLinkConfigToolStripMenuItem.ToolTipText
source: Remove the link of the config that was linked with this aircraft.
de: Entferne die Verlinkung von Config zu Flugzeug

# autoloadToggleToolStripMenuItem.Text
source: Auto-load linked config
de: Autom. verknüpfte Config laden

# autoloadToggleToolStripMenuItem.ToolTipText
source: Automatically load linked configs for detected aircraft.
de: Lade automatisch die verlinkte Konfiguration des detektierten Flugzeugs.

# toolStripAircraftDropDownButton.Text
source: No aircraft detected
de: Kein Flugzeug detektiert.
