Repository: MobiFlight/MobiFlight-Connector
Catalog: ProjectMessages/ProjectMessages.*.resx
Languages: de

source: Connect
de: Verbinden

source: Disconnect
de: Trennen

source: none
de: keins

source: Retry
de: Wiederholen

source: Running
de: Läuft

# statusFsuipcConnected
source: FSUIPC is connected.
de: FSUIPC ist verbunden.

# uiMessageAraceUSBHasBeenRemoved
source: An Arcaze module has been removed.
de: Ein Arcaze Modul wurde entfernt.

# uiMessageNoModuleFound
source: No modules found
de: Keine Module gefunden

source: Stopped
de: Gestoppt

source: Hint
de: Hinweis

# uiMessageArcazeConnectionLost
source: The connection to the arcaze module got lost
de: Die Verbindung mit einem Arcaze Modul wurde unterbrochen.

# uiMessageMFConnectorInterfaceActive
source: MFConnector still active
de: MFConnector noch aktiv

# uiMessageFsuipcConnectionLost
source: The connection to FSUIPC got lost
de: Die Verbindung zu FSUIPC wurde unterbrochen.

# uiMessageModuleFound
source: Show detected modules
de: Gefundene Module anzeigen

# uiMessageApplicationIsRunningInBackgroundMode
source: Application is now running in the background.
de: Die Anwendung läuft jetzt im Hintergrund.

source: Input validation
de: Eingabeprüfung

# uiMessageInvalidValueHexOnly
source: Invalid Value! Only use hex-encoded numbers.
de: Ungültige Eingabe! Bitte nur hexadezimale Zahlen angeben.

# uiMessageConfirmNewConfig
source: Do you really want to create a new config? All unsaved changes will get lost.
de: Wollen Sie wirkliche eine neue Konfiguration anlegen? Alle ungespeicherten Änderungen gehen dabei verloren.

source: Find
de: Suchen

# uiMessageFsHasBeenStopped
source: The Flight Simulator has been closed. Execution of config has been stopped. Restart your flight simulator to restart config.
de: Der Flugsimulator wurde beendet. Die Ausführung der Konfiguration wurde gestoppt. Starten Sie den Flugsimulator neu um die Konfiguration erneut auszuführen.

source: Test Mode
de: Test Modus

# TestModeToolTip
source: Execute Config line by line and trigger the corresponding pin
de: Führe zeilenweise Konfiguration aus und steuere jede Ausgabe für einen Test an

# uiLabelDoubleClickToAddConfig
source: Double-click row to add new config...
de: Doppelklicken für neuen Eintrag...

# DefaultFileName
source: unsaved
de: neu

# uiMessageConfirmDiscardUnsaved
source: There are unsaved changes in your configuration. Do you want to save them now?
de: Es sind noch Änderungen ungespeichert. Möchten Sie die Änderungen jetzt speichern?

# uiMessageConfirmDiscardUnsavedTitle
source: Please check
de: Bitte prüfen Sie

# uiMessageConfirmNewConfigTitle
source: Please confirm
de: Bitte bestätigen Sie

# ConfigErrorException_AddressNull
source: The address of a Display Module must not be null. Please review your config.
de: Die Adresse eines Display Moduls darf nicht null sein. Bitte prüfen Sie Ihre Konfigurationsdatei.

# ConfigErrorException_SerialNull
source: The serial of an Arcaze Module must not be null. Please review your config.
de: Die Seriennummer eines Moduls darf nicht null sein. Bitte prüfen Sie Ihre Konfigurationsdatei.

# ConfigErrorException_WritingDisplay
source: Error on writing values to Display Module. Please review your config.
de: Fehler beim Schreiben von Werten auf das Display Modul. Bitte prüfen Sie Ihre Konfigurationsdatei.

source: Please Choose
de: Bitte wählen

# Label_Precondition_ArcazePin
source: Arcaze Pin
de: Pin

# Label_Precondition_ConfigItem
source: Config item
de: Config Eintrag

# Label_Precondition_None
source: none
de: Keine

source: Please select a pin.
de: Bitte wählen Sie einen Pin.

source: Please select a port.
de: Bitte wählen Sie einen Port.

# uiException_ConfigItemNotFound
source: Config object was null.
de: Config object ist null.

# uiMessageConfigLineNotSavedYet
source: This config line is not saved yet. Set the description text and use the edit button then.
de: Der Zeile wurde noch nicht gespeichert und kann daher nicht bearbeitet werden. Legen Sie zuerst den Beschreibungstext fest und editieren Sie dann den Eintrag.

# uiMessageConfigWizard_ErrorLoadingPresets
source: Error on loading presets. Presets are not available for selection.
de: Fehler beim Laden der Presets. Presets können nicht aus der Liste gewählt werden.

# uiMessageConfigWizard_PresetsNotFound
source: Presets file not found in current directory.
de: Datei mit Presets konnte nicht im aktuellen Verzeichnis gefunden werden.

# uiMessageConfigWizard_ProvideLedDisplayAddress
source: Please provide the address of the desired Led Display Module. It must be numeric, e.g. 1
de: Bitte geben Sie die gewünschte Adresse des Display Driver an. Es muss numerisch sein, z.B. 1.

# uiMessageConfigWizard_SelectArcaze
source: Please select a module by choosing a valid serial from the list.
de: Bitte gültiges Modul aus Liste auswählen.

# uiMessageConfigWizard_SelectComparison
source: Please provide a value for comparison.
de: Bitte geben sie eine Art für den Vergleich an.

# uiMessageConfigWizard_ValidHexFormat
source: Please review the value and provide a valid hex format (0-F).
de: Bitte prüfen Sie die Angabe und geben Sie ein gültiges Hex-Format an (0x0-0xF).

# uiMessageModulesNotConfiguredYet
source: It seems that your arcaze modules are not configured. This is a new feature to better support "Extension Modules". You should configure them now.
de: Die angeschlossenen Arcaze Module sind scheinbar noch nicht konfiguriert. Die ist ein neues Feature, um besser "Extension-Module" zu unterstützen. Führen Sie die Konfiguration jetzt unbedingt durch.

# uiMessageNotImplementedYet
source: Not implemented yet.
de: Noch nicht implementiert.

# uiMessagePreconditionNotSatisfied
source: Precondition is not satisfied
de: Vorbedingung ist nicht erfüllt.

source: Edit
de: Bearbeiten

# WebsiteUrlHelp
source: https://www.mobiflight.com/en/documentation/software.html
de: https://www.mobiflight.com/de/dokumentation/software.html

# suffixCopy
source: Copy
de: Kopie

# uiMessageErrorOnParsingExpression
source: An error occurred on parsing your value formula. Please review and correct any errors.
de: Bei der Anwendung Ihrer Formel trat ein Fehler auf. Bitte prüfen Sie Ihre Formel.

# uiMessageNoOrphanedSerialsFound
source: There are no orphaned serials in the current config.
de: Es sind keine verwaisten Serial-Einträge in der aktuellen Konfiguration enthalten.

# uiMessageCmdParamConfigFileDoesNotExist
source: The config file passed as parameter does not exist.
de: Die als Parameter übergebene Config-Datei existiert nicht.

# uiMessageMigrateConfigFileYesNo
source: The config file has to be converted to work correctly. Please save with new file extension.
de: Die Konfiguration muss konvertiert und unter neuem Namen gespeichert werden.

# MFModuleConfigChanged
source: There are still changes not uploaded to your modules. You will lose these changes if you close the form. Do you really want to continue?
de: Es wurden Änderungen an der Konfiguration von MobiFlight Modulen gemacht und diese Änderungen wurden noch nicht auf die Module gespeichert. Möchtest Du trotzdem den Dialog schließen? Die Änderungen gehen dabei verloren.

# uiMessageDeviceNameAlreadyUsed
source: The name of the device has already been used, please review.
de: Der Name ist für ein angeschlossenes Gerät schon verwendet. Gerätenamen müssen eindeutig sein. Bitte prüfen.

# uiMessageFsuipcConfigPanelMultiplyWrongFormat
source: Multiply value must contain a valid number.
de: Das Multiply-Feld muss eine gültige Zahl enthalten.

# uiMessageFsuipcConfigPanelNoValue
source: The value must not be empty. Use numbers or expressions like $+1, etc.
de: Der Wert darf nicht leer sein. Verwende Zahlen oder Expression wie $+1, etc.

# uiMessageSelectedModuleDoesNotContainAnyInputDevices
source: The selected module does not contain any input devices. Do you want to add such devices?
de: Das ausgewählte Modul enthält keine Eingabegeräte. Möchtest Du welche konfigurieren?

# uiMessageNoUpdateNecessary
source: You are running the latest version {0}. No update necessary.
de: Du hast die aktuellste Version {0}. Kein Update notwendig.

# uiMessageSettingsDialogFirmwareVersionTooLowException
source: The current firmware does not support this function. Please update to the current firmware first.
de: Die Firmware auf diesem Board unterstützt die Funktion noch nicht. Update auf die aktuellste Firmware zuerst!

# uiMessageDeviceNameContainsInvalidCharsOrTooLong
source: The name for the device is not valid or too long (max. {1} characters). Don't use the following characters: {0}
de: Ungültiger Name oder zu lang (max. {1} Zeichen). Die folgenden Buchstaben können nicht verwendet werden: {0}

# uiMessageMigrateConfigFileV60YesNo
source: Old config format (< 6.0) found. The config file has to be converted to work correctly. Do you want to use a new filename?
de: Altes Format erkannt (<6.0). Die Konfiguration muss konvertiert werden. Möchtest Du sie unter einem neuen Namen speichern?

# uiMessageFirmwareCheckPath
source: Please verify your firmware settings! You have to provide the path to a valid Arduino IDE installation (min 1.0.5).
de: Bitte prüfe Deine Firmware-Flash-Einstellungen. Du musst einen gültigen Pfad zu Deiner Arduino IDE angeben (min. 1.0.5).

# uiMessageUploadConfigurationConfirm
source: Do you really want to update your module with the current configuration?
de: Möchtest Du Dein Board wirklich mit der Config aktualisieren?

# uiMessageUploadConfigurationFinished
source: Upload finished.
de: Der Upload ist fertig!

# uiMessageUploadConfigurationHint
source: Upload configuration
de: Config Upload

# uiMessageUploadConfigurationTooLong
source: Your config is too long, make some labels shorter
de: Die Config ist zu lang, mach ein paar Geräte-Namen kürzer.

# uiMessagePanelsStepperInputRevolutionsMustBeGreaterThan0
source: The value must be a number and greater than 0.
de: Der Wert muss eine Zahl sein und größer als 0.

# uiMessagePanelsStepperInputRevolutionsMustNonEmpty
source: The value must not be empty.
de: Der Wert darf nicht leer sein.

# uiMessageUpdateArduinoOkCancel
source: Modules found that are compatible with MobiFlight. To be able to use them they require the latest MobiFlight Firmware. Upload the MobiFlight Firmware now!
de: Es wurden kompatible Arduinos ohne MobiFlight Firmware gefunden. Um sie zu verwenden benötigen sie die neueste Firmware. Jetzt MobiFlight Firmware hochladen!

# uiMessageUpdateOldFirmwareOkCancel
source: Some Mobiflight Boards have an old firmware - update them now?
de: Die Firmware der MobiFlight Boards ist nicht aktuell - jetzt updaten?

# uiMessageFirmwareUploadSuccessful
source: The firmware update was successful!
de: Das Firmware Update war erfolgreich!

# uiMessageInvalidArduinoIdePath
source: Please check your Arduino IDE installation. The path cannot be used, avrdude has not been found.
de: Bitte Prüfe den Pfad zur Arduino IDE. Das Tool avrdude konnte nicht gefunden werden.

# uiMessageSettingsDlgOldFirmware
source: Old firmware, update now!
de: Alte firmware, update jetzt!

# uiMessageValidNumberInRange
source: Value must be a number between {0} and {1}.
de: Wert muss eine Zahl zwischen {0} und {1} sein.

# uiMessageConfigWizardInterpolationOnlyNumbersPlease
source: Only numbers allowed. Please check your input.
de: Es sind nur Zahlen erlaubt. Bitte prüfe Deine Eingabe.

# uiMessageProblemLoadingConfig
source: Your Config could not be loaded. Please check for syntax errors.
de: Die Config konnte nicht geladen werden. Bitte prüfe auf Syntaxfehler.

# uiMessageUpdateArduinoFwAutoDisableYesNo
source: Do you want to disable the automatic upload to new modules? You can always enable it later again in the settings menu.
de: Möchtest Du das automatische Updaten von neuen Arduinos deaktivieren? Du kannst es jederzeit wieder in den Einstellungen aktivieren

# uiMessageUploadConfigurationFinishedWithError
source: Upload finished with error.
de: Der Upload war nicht erfolgreich.

# uiMessageNotEnoughPinsHint
source: Not enough pins
de: Nicht genügend Pins

# uiMessageNotEnoughPinsMessage
source: Not enough free pins to add this device
de: Nicht genügend freie Pins zum Anlegen dieses Devices vorhanden

# uiMessageNoFSUIPCConnection
source: No active FSUIPC connection.
de: Keine aktive FSUIPC Verbindung.

# uiMessageTransformError
source: Transform Error.
de: Fehler bei Transform.

# uiMessageTestModeModuleNotConnected
source: Error during Test-Mode: Module not connected.
de: Fehler im Test-Modus: Modul nicht angeschlossen.

# uiMessageNewUpdateAvailable
source: MobiFlight Update available!
de: Neues Update verfügbar!

# uiMessageNewUpdateAvailablePleaseUpdate
source: YEAH! - New Version {0} is available! Please update now.
de: YEAH! - Neue Version {0} verfügbar. Bitte jetzt aktualisieren.

# uiMessageWasmUpdateAlreadyInstalled
source: MobiFlight WASM Module is already installed and up-to-date.
de: Du hast das aktuelle MobiFlight WASM Modul bereits installiert.

# uiMessageWasmUpdateCommunityFolderNotFound
source: MSFS2020 Community Folder was not found. Can't install WASM Module automatically. Please copy the folder manually.
de: MSFS2020 Community Verzeichnis nicht gefunden. WASM Module kann nicht automatisch kopiert werden. Bitte kopiere das Verzeichnis manuell an die richtige Stelle.

# uiMessageWasmUpdateInstallationError
source: MobiFlight WASM Module was not installed successfully. Please check the Log for more information.
de: MobiFlight WASM Module konnte nicht installiert werden. Bitte checke das Log für weitere Details.

# uiMessageWasmEventsInstallationError
source: Latest WASM Events could not be installed. Please check Log for more information.
de: Neueste WASM Events konnten nicht installiert werden. Bitte checke das Log für weitere Details.

# uiMessageWasmEventsInstallationSuccessful
source: Latest WASM Events installed successfully.
de: Neueste WASM Events wurden erfolgreich installiert.

# uiMessageSelectedModuleDoesNotContainAnyOutputDevices
source: The selected module does not contain any output devices. Do you want to add such devices?
de: Das ausgewählte Modul enthält keine Ausgabegeräte. Möchtest Du welche konfigurieren?

# uiMessageNoSimConnectConnection
source: No active SimConnect Connection
de: Keine aktive SimConnect Verbindung.

# uiMessageSimConnectConnectionLost
source: The connection to SimConnect got lost.
de: Die Verbindung zu SimConnect wurde unterbrochen.

# uiMessageMaxNumberOfDevicesReached
source: You cannot add another {1}. The maximum is {0} on a {2}.
de: Du kannst kein weiteres {0} hinzufügen. Die maximale Anzahl sind {1} bei einem {2}.

# uiMessageConfigNotFound
source: Configuration file not found. Please check path to config file.
de: Konfiguration konnte nicht geladen werden. Check den Pfad zur Datei.

# uiMessageFirmwareUploadError
source: There was an error on uploading the firmware for the board(s): {0} Check log for more details.
de: Es gab einen Fehler beim Firmware Upload. Aktiviere Logging für mehr Informationen.

# uiMessageNoNotConnectedJoysticksInConfigFound
source: There are no missing joysticks found.
de: Keine fehlenden Joysticks gefunden.

# uiMessageNotConnectedJoysticksInConfigFound
source: The following joysticks are currently not connected but referenced in the config: {0} Respective configs won't work until joysticks are connected and you have restarted MobiFlight.
de: Die folgenden Joysticks sind aktuell nicht angeschlossen, werden aber in der Config verwendet: {0} Die entsprechenden Konfigurationen funktionieren nicht bis der Joystick wieder angeschlossen und MobiFlight neu gestartet ist.

# uiMessageFirmwareUpdateStatus
source: Updating {0} on {1} (Module {2}/{3})
de: Update von {0} an {1} (Modul {2}/{3})

# uiMessageUpdateArduinoTitle
source: Compatible boards found!
de: Kompatible Boards gefunden!

# uiMessageUpdateOldFirmwareTitle
source: New Firmware Available!
de: Neue Firmware verfügbar!

# uiMessageNoMoreConfigReferenceAvailable
source: You already can reference all available configs. Adding more doesn't make sense.
de: Du kannst schon alle Configs referenzieren. Mehr hinzuzufügen macht keinen Sinn.

# uiMessagesSimConnectPanelMatchesFound
source: {0} matches found.
de: {0} Treffer gefunden

# uiMessagesSimConnectPanelShowAll
source: - show all -
de: - Alle zeigen -

# uiSettingsMobiFlightChangeRequiresRestart
source: This change will require a restart of MobiFlight to become effective.
de: Diese Änderung benötigt einen Neustart von MobiFlight.

# uiMessageFirmwareResetComplete
source: {0} ({1}) firmware reset completed ({2}/{3})
de: {0} ({1}) Firmware Reset fertig. ({2}/{3})

# uiMessageFirmwareResetStatus
source: Updating {0} on {1} (Module {2}/{3})
de: Update von {0} an {1} (Modul {2}/{3})

# uiMessageFirmwareResetTimeout
source: {0} ({1}) firmware reset timed out ({2}/{3})
de: {0} ({1}) Firmware Reset time out. ({2}/{3})

# uiMessageFirmwareUpdateComplete
source: {0} ({1}) firmware update completed ({2}/{3})
de: {0} ({1}) Firmware Update fertig.({2}/{3})

# uiMessageFirmwareUpdateTimeout
source: {0} ({1}) firmware update timed out ({2}/{3})
de: {0} ({1}) Firmware Update time out ({2}/{3})

# uiI2CPinInUse
source: {0} requires the use of pin {1} which is already assigned to another module. Remove the pin assignment from the other module then try adding {0} again.
de: {0} braucht Pin {1} welcher bereits verwendet wird. Lösche die Zuordnung und versuche es mit {0} nochmal.

# uiI2CPinInUseHint
source: I2C pin in use
de: I2C Pin in Verwendung

# uiMessageFirmwareResetSuccessful
source: The board reset was successful!
de: Der Reset Deines Boards war erfolgreich.

# uiMessageRestartRequired
source: This change will require a restart of MobiFlight to become effective.
de: Damit diese Änderung wirksam wird, benötigt MobiFlight einen Neustart.

# uiMessageFirmwareUploadAmbiguousBoards
source: Some boards can't be auto-flashed because the board type is ambiguous: {0} Please manually flash the boards using "upload firmware" and select the correct board type from the menu.
de: Ein oder mehrer Boards konnten nicht automatisch mit der MobiFlight Firmware geflasht werden. {0} Bitte führe im nächsten Dialog das Flashen manuell durch und wähle den passenden Board-Typ aus dem Kontextmenü.

# uiMessageFirmwareResetError
source: There was an error on resetting the board(s): {0} Check log for more details.
de: Es gab einen Fehler beim Board Reset. Aktiviere Logging für mehr Informationen.

# uiMessageFirmwareUploadTimeout
source: The firmware upload experienced a timeout.
de: Das Firmware Upload hat einen Timeout gemeldet. Aktiviere Logging für mehr Informationen.

# Label_Precondition_choose_config
source: Choose config
de: Wähle Config

# Label_Precondition_choose_variable
source: Choose variable
de: Wähle Variable

# uiMessageValidationMustBeNumber
source: The value must be a valid number.
de: Der Wert muss eine gültige Zahl sein.

# uiMessageHubHopUpdateError
source: Error on downloading HubHop presets. Please check the Log for more information.
de: Update der HubHop Presets war nicht erfolgreich. Bitte checke das Log für weitere Details.

# uiMessageHubHopUpdateSuccessful
source: HubHop presets download was successful.
de: Update der HubHop Presets war erfolgreich.

# uiMessageResetConfirm
source: Do you really want to uninstall the MobiFlight firmware? All your data will be removed from the board.
de: Möchtest Du wirklich die MobiFlight Firmware deinstallieren? Alle Deine Daten werden vom Board gelöscht.

# uiMessageResetHint
source: Reset Board
de: Board zurücksetzen

# uiMessageNoXplaneConnection
source: No active X-Plane connection
de: Keine aktive X-Plane Verbindung

# uiMessageNotConnectedMidiBoardsInConfigFound
source: The following midiboards are currently not connected but referenced in the config: {0} Respective configs won't work until midiboards are connected and you have restarted MobiFlight.
de: Die folgenden Midiboards sind aktuell nicht angeschlossen, werden aber in der Config verwendet: {0} Die entsprechenden Konfigurationen funktionieren nicht bis der Midiboard wieder angeschlossen und MobiFlight neu gestartet ist.

# uiMessageNoNotConnectedMidiBoardsInConfigFound
source: There are no missing midiboards found.
de: Keine fehlenden Midiboards gefunden.

# uiMessageMidiBoardInUsageByOtherProcess
source: The following midiboard is currently in usage by another process: {0} That midiboard cannot be used until other application is terminated and MobiFlight is restarted.
de: Das folgende Midiboard wird gerade von einem anderen Prozess verwendet: {0} Dieses Midiboard kann nicht verwendet werden bis die andere Applikation beendet und Mobiflight neu gestartet ist.
